# Homework 4 - SQL Queries

In [26]:
import pandas as pd
pd.set_option('display.max_columns', 500)
%matplotlib inline

#### 1) Give a count of all videos currently out.

SELECT count(1) - count(return_date) As Not_returned_number<br />
FROM rental

In [32]:
df = pd.read_csv('HW4_CSV/Query_1_2017_04_07.csv', index_col=0)
df.head(n=10)

Empty DataFrame
Columns: []
Index: [183]

The query was created on the assumption that the ‘return_date’ needs to have a value to register a return, and a NULL entry meant that the customer had not returned the film.

#### 5) What hour of the day to people rent the most?

SELECT SUBSTRING(CAST(rental_date AS CHAR(50)),12,2) AS HOUR, COUNT(*) AS C<br />
FROM rental<br />
GROUP BY HOUR<br />
ORDER BY C DESC

In [33]:
df = pd.read_csv('HW4_CSV/Query_5_2017_04_07.csv', index_col=0)
df.head(n=10)

    hour    c
1     15  887
2      8  696
3      0  694
4     18  688
5      3  684
6      4  681
7     19  676
8     10  673
9     21  671
10     7  667

3 PM is the most rented hour of the day

#### 6.	Which store is more profitable, assuming all movies cost 15 dollars per inventory item to purchase?

SELECT country AS Store_Country,<br />
       count(*) AS Number_rentals, <br />
       15 * count(*) AS Sales_Dollars<br />
FROM rental,<br />
     inventory,<br />
     country,<br />
     city,<br />
     address,<br />
     store<br />
WHERE rental.inventory_id = inventory.inventory_id<br />
  AND inventory.store_id = store.store_id<br />
  AND store.address_id = address.address_id<br />
  AND city.city_id = address.city_id<br />
  AND country.country_id = city.country_id<br />
GROUP BY Store_country<br />
ORDER BY Number_rentals DESC

In [34]:
df = pd.read_csv('HW4_CSV/Query_6_2017_04_07.csv', index_col=0)
df.head(n=10)

               number_rentals  sales_dollars
store_country
Australia                8121         121815
Canada                   7923         118845

The store in Australia is more profitable assuming a fixed rental rate of $15 for all movies.

#### 3)	Give the most popular actors by store location.

SELECT concat(first_name, last_name) AS NAMES,<br />
       COUNT (*) AS c<br />
FROM film_actor,<br />
     inventory,<br />
     rental,<br />
     actor<br />
WHERE rental.inventory_id = inventory.inventory_id<br />
  AND film_actor.film_id = inventory.film_id<br />
  AND inventory.store_id = 2<br />
  AND actor.actor_id = film_actor.actor_id<br />
GROUP BY Names<br />
ORDER BY c DESC

In [35]:
df = pd.read_csv('HW4_CSV/Query_3_Names_S1_2017_04_07.csv', index_col=0)
df.head(n=10)

                 c
names
SusanDavis     448
GinaDegeneres  392
MichaelBolger  324
SeanGuiness    318
MatthewCarrey  317
MaryKeitel     315
JayneNolte     313
WarrenNolte    310
ValBolger      304
EwanGooding    300

List of most popular actors for Store 1

In [36]:
df = pd.read_csv('HW4_CSV/Query_3_Names_S2_2017_04_07.csv', index_col=0)
df.head(n=10)

                     c
names
SusanDavis         377
GinaDegeneres      361
MatthewCarrey      361
MaryKeitel         359
AngelaWitherspoon  355
WalterTorn         347
ChristianAkroyd    333
ScarlettDamon      318
HenryBerry         315
AngelaHudson       312

List of most popular actors for Store 2

Using count on the actor_id column and not the concatenated names gave a different result as some of the entries had multiple actor ids for the same actor.

Eg: Susan Davis has an actor ID of both 101 and 110